Update and revert thesis information
====================================
บทความนี้อธิบายวิธีการใช้งานฟังก์ชั่น update และ revert เพื่อการอัปเดตให้ข้อมูลในเอกสารตรงกับบน Web portal เนื่องจากในการ save to cloud ระบบจะตรวจสอบก่อนว่าข้อมูลตรงกันหรือไม่ หากไม่ตรงกันจำเป็นต้องกลับไปตรวจสอบและปรับแก้ให้ตรงกันก่อน


การใช้ Update และ revert
-----------------

นิสิต/นักศึกษาสามารถแก้ไขข้อมูลที่อยู่ในเอกสารได้ตามที่ต้องการ โดยแก้ไขที่กล่องข้อความได้เลย (ระมัดระวังการพิมพ์นอกกล่องข้อความ) หากต้องการอัพเดตข้อมูลไปยังเว็บพอร์ทัลเพื่อให้สามารถบันทึกไฟล์เข้าสู่ระบบ (save to cloud) ได้ มีขั้นตอนในการปรับแก้ดังต่อไปนี้

1. เมื่อแก้ไขข้อมูลที่กล่องข้อความ จะมีข้อความแจ้งเตือน "Data on web portal did not match with the document." ปรากฏขึ้น


.. figure:: /images/update01.png
    :align: center

2. กด Preview จะพบกับหน้าต่างแสดงข้อมูลเปรียบเทียบระหว่างข้อมูลในเอกสาร (document) และบนเว็บพอร์ทัล (web portal)
 * หากต้องการอัพเดตข้อมูลที่พิมพ์ในเอกสารไปยังเว็บพอร์ทัล กด update 
 * หากต้องการคืนค่าข้อมูลในเอกสารให้ตรงกับที่อยู่ในเว็บพอร์ทัล กด revert
3. กด Sync และ Preview เพื่อตรวจสอบข้อมูล 

.. figure:: /images/validate02.png
    :align: center


Validate Template
-----------------
เป็นฟังก์ชั่นที่ใช้สำหรับตรวจสอบข้อมูลบนเอกสารว่าตรงกับบนเว็บพอร์ทัลหรือไม่

* กด validate เพื่อตรวจสอบรูปเล่มก่อนจะ save to cloud 
* ระบบจะแจ้งรายการที่ต้องปรับแก้ และสามารถคลิกเพื่อปรับแก้ได้เลย

.. figure:: /images/validate01.png
    :align: center

* หากต้องการอัพเดตข้อมูลที่พิมพ์ในเอกสารไปยังเว็บพอร์ทัล กด update 
* หากต้องการคืนค่าข้อมูลในเอกสารให้ตรงกับที่อยู่ในเว็บพอร์ทัล กด revert



.. note::

   ไม่สามารถ Validate บน WordOnline ได้


ข้อควรระวังเมื่อต้องการคืนค่าข้อมูลโดยใช้ revert
--------------------------------------

เมื่อนักศึกษาต้องการคืนค่าข้อมูลที่แก้ไขไปจากเดิม สามารถกด revert เพื่อดึงข้อมูลที่บันทึกในเว็บพอร์ทัลลงมาที่เอกสารได้ ทั้งนี้การกด revert อาจมีผลต่อรูปแบบอักษรที่จัดไว้ เช่น ขนาดตัวอักษร แบบอักษร โดยส่วนมากจะเป็นการคืนค่าแบบอักษรที่ตั้งค่าเริ่มต้นของ style ที่ใช้งานอยู่ด้วย
.. figure:: /images/update02.gif
    :align: center
